In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [5]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [7]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [8]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [10]:
df.idxmax()

one    b
two    d
dtype: object

In [11]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [12]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [13]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [14]:
obj = pd.Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [15]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [16]:
import pandas as pd
import numpy as np

In [18]:
string_data = pd.Series(['aardvark' , 'artichoke' , np.nan , 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [19]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [20]:
string_data[0] = None

In [21]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [22]:
from numpy import nan as NA

In [23]:
data = pd.Series([1,NA,3.5,NA,7])

In [24]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [25]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [26]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
cleaned = data.dropna()

In [28]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [29]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [31]:
data.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [32]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.966137  0.306043  1.493290
1 -1.417073 -1.067899  0.249013
2  0.492818  0.350491  1.044056
3 -0.204677  1.341890  0.011418
4  0.867982 -0.430098 -0.498406
5 -0.864203  0.403711  0.663892
6 -0.022540 -0.359763 -0.610419

In [33]:
df.iloc[:4,1] = NA
df

          0         1         2
0 -0.966137       NaN  1.493290
1 -1.417073       NaN  0.249013
2  0.492818       NaN  1.044056
3 -0.204677       NaN  0.011418
4  0.867982 -0.430098 -0.498406
5 -0.864203  0.403711  0.663892
6 -0.022540 -0.359763 -0.610419

In [35]:
df.dropna()

          0         1         2
4  0.867982 -0.430098 -0.498406
5 -0.864203  0.403711  0.663892
6 -0.022540 -0.359763 -0.610419

In [37]:
df.fillna(0)

          0         1         2
0 -0.966137  0.000000  1.493290
1 -1.417073  0.000000  0.249013
2  0.492818  0.000000  1.044056
3 -0.204677  0.000000  0.011418
4  0.867982 -0.430098 -0.498406
5 -0.864203  0.403711  0.663892
6 -0.022540 -0.359763 -0.610419